config/cf/InformationRegisters/РеквизитыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследнийВПереписке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнициаторЗадания</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/Catalogs/Комментарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Комментарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКомментария</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приватный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адресаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаблюдателиЗадания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/InformationRegisters/РеквизитыЗаданий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьДополнительныеРеквизитыЗадания(Знач ЗаданиеСтруктура) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.РеквизитыЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЗаданиеСтруктура.Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись 			= НаборЗаписей.Добавить();
		Запись.Объект 	= ЗаданиеСтруктура.Ссылка;
	Иначе
		Запись 			= НаборЗаписей[0];
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Комментарии.Автор КАК Автор
		|ИЗ
		|	Справочник.Комментарии КАК Комментарии
		|ГДЕ
		|	Комментарии.ВладелецКомментария = &ОбъектСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Комментарии.Код УБЫВ";

	Запрос.УстановитьПараметр("ОбъектСсылка", ЗаданиеСтруктура.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	ПоследнийАвтор = Справочники.Пользователи.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		ПоследнийАвтор = Выборка.Автор;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПоследнийАвтор) Тогда
		// Комментарии есть, записываем последнего автора комментария.
		Запись.ПоследнийВПереписке = ПоследнийАвтор;
	Иначе
		// Задание без комментариев, записываем автора последним в переписке.
		Запись.ПоследнийВПереписке = ?(ЗначениеЗаполнено(ЗаданиеСтруктура.Инициатор),
			ЗаданиеСтруктура.Инициатор, ЗаданиеСтруктура.Автор);
	КонецЕсли;
	
	Запись.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Устанавливает дату последнего изменения задания.
//
// Параметры:
//		Объект - ДокументСсылка.Задание;
//		ДатаИзменения - Дата.
//
//	Возвращаемое значение:
//		Результат - Булево - признак установки реквизита.
//		
Функция УстановитьДатуПоследнегоИзменения(Знач Объект, Знач ДатаИзменения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Ложь;	
	
	Если ДатаИзменения = Неопределено Тогда
		ДатаИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
		
	МенеджерЗаписи					= РегистрыСведений.РеквизитыЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект 			= Объект;	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ДатаПоследнегоИзменения = ДатаИзменения;
		Попытка
			МенеджерЗаписи.Записать(Истина);
			Результат = Истина;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при установке даты последнего изменения.'"), 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		КонецПопытки;			
	Иначе
		МенеджерЗаписи.Объект 						= Объект;		
		МенеджерЗаписи.ДатаПоследнегоИзменения = ДатаИзменения;
		Попытка
			МенеджерЗаписи.Записать(Истина);
			Результат = Истина;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при установке даты последнего изменения.'"), 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		КонецПопытки;
	КонецЕсли;		 	
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение указанного реквизита задания.
//
// Параметры:
//	Объект - ДокументСсылка.Задание - владелец реквизита;
//	ИмяРеквизита - Строка - имя реквизита.
//
// Возвращаемое значение:
//	Произвольный тип, Неопределено - значение реквизита.
//
Функция ПолучитьРеквизитЗадания(Знач Объект, Знач ИмяРеквизита) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи[ИмяРеквизита];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
			 
КонецФункции

#КонецОбласти
	
#КонецЕсли
